In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv(".//titanic.csv")

In [3]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
titanic = pd.read_csv("https://math.univ-angers.fr/~ducrot/pyds1/data/titanic.csv",
                      index_col=0, usecols=[0,1,2,4,5])

In [5]:
titanic

             Survived  Pclass     Sex   Age
PassengerId
1                   0       3    male  22.0
2                   1       1  female  38.0
3                   1       3  female  26.0
4                   1       1  female  35.0
5                   0       3    male  35.0
...               ...     ...     ...   ...
887                 0       2    male  27.0
888                 1       1  female  19.0
889                 0       3  female   NaN
890                 1       1    male  26.0
891                 0       3    male  32.0

[891 rows x 4 columns]

In [6]:
len(titanic.index)

891

In [7]:
#titanic.groupby('Sex')['Sex'].count()
GBSex = titanic.groupby('Sex')
GBSex.count()

        Survived  Pclass  Age
Sex
female       314     314  261
male         577     577  453

In [8]:
GBSurv = titanic.groupby('Survived')
GBSurv.count()

          Pclass  Sex  Age
Survived
0            549  549  424
1            342  342  290

In [9]:
GBSex["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [51]:
GBSexCab = titanic.groupby(['Sex','Pclass'])
print(GBSexCab['Survived'].mean())
print(GBSexCab['Survived'].sum())

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64
Sex     Pclass
female  1         91
        2         70
        3         72
male    1         45
        2         17
        3         47
Name: Survived, dtype: int64

In [11]:
GBSexCab['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [12]:
GBSex["Survived"].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [13]:
Age = pd.cut(titanic['Age'], [0, 18, 120])

In [14]:
Age

PassengerId
1      (18.0, 120.0]
2      (18.0, 120.0]
3      (18.0, 120.0]
4      (18.0, 120.0]
5      (18.0, 120.0]
           ...
887    (18.0, 120.0]
888    (18.0, 120.0]
889              NaN
890    (18.0, 120.0]
891    (18.0, 120.0]
Name: Age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 120]]

In [15]:
titanic.groupby(Age)["Survived"].sum()

Age
(0, 18]       70
(18, 120]    220
Name: Survived, dtype: int64

In [16]:
titanic.groupby(Age)["Survived"].mean()

Age
(0, 18]      0.503597
(18, 120]    0.382609
Name: Survived, dtype: float64